export const ads = [
  {
    _id: 'cjv7wg90200002y5rsnut9f3e',
    author_name: 'Artem',
    created_at_datetime: '2019-05-03T12:52:19+03:00',
    title: 'Что такое JavaScript?',
    description:
      'Это язык программирования, который выполняется в браузере посетителя веб-страницы. Это не Java, как новички иногда сокращают называние JavaScript. Java — это совсем другое, и к JavaScript он не имеет никакого отношения. Последний задумывался и создавался для того, чтобы добавить некоторую интерактивность и оживить веб-сайты.\n\nВ разработке сайтов JS идет вместе с HTML и CSS. HTML определяет разметку страницы, CSS — внешний вид, а JavaScript вносит интерактивность. То есть с его помощью мы можем описать, как разметка и стили отреагируют на те или иные действия пользователя.',
  },
  {
    _id: 'cjv7wmrd500012y5riy0rykiq',
    author_name: 'Artem',
    created_at_datetime: '2019-05-03T12:57:23+03:00',
    title: 'Web Worker JavaScript',
    description:
      'W3C опубликовал первый проект стандарта Web Worker в 2009 году. С полной спецификацией можно ознакомиться на веб-сайте Рабочей группы по технологиям веб-гипертекстовых приложений — или WHATWG — альтернативной W3C организации по веб-стандартам.\n\nWeb Worker — это асинхронная система или протокол, позволяющий веб-страницам выполнять задачи в фоновом режиме независимо от основного потока и пользовательского интерфейса веб-сайта. Это изолированная среда, которая отделена от объекта window, объекта document, прямого доступа в Интернет и лучше всего подходит для длительных или сложных вычислительных задач.\n\nПомимо Web Worker — системы, предназначенной для многопоточности — существуют и другие способы выполнения асинхронной обработки в JavaScript, такие как асинхронные вызовы Ajax и цикл обработки событий.',
  },
  {
    _id: 'cjv7wpcgj00022y5rtui74uls',
    author_name: 'Artem',
    created_at_datetime: '2019-05-03T12:59:23+03:00',
    title: 'Что такое TypeScript',
    description:
      'TypeScript является строго типизированным надмножеством JavaScript, что означает, что он добавляет некоторые синтаксические преимущества для языка, но при этом позволяет писать обычный JavaScript, если хотите. Он поощряет более декларативный стиль программирования через такие вещи, как интерфейсы и статическую типизацию (подробнее об этом позже), предлагает модули и классы, а самое главное, довольно хорошо интегрируется с популярными библиотеками и кодом JavaScript. Вы могли бы подумать об этом как о сильном статическом уровне над текущим JavaScript, который имеет несколько функций, чтобы сделать жизнь (и отлаживать особенно) более терпимой.\n\nTypeScript получил особое внимание несколько лет назад, потому что был выбран для полной поддержки с помощью Angular 2 и выше (что написано в самом TypeScript). Он также разработан Microsoft, что означает, что он поддерживает две крупные технические компании (неплохое место для любого языка). С этого времени он получил статус основного.\n\nСтоит пересмотреть свои взгляды на TypeScript.',
  },
  {
    _id: 'cjv7wv7cv00032y5r9yyvmj2x',
    author_name: 'Artem',
    created_at_datetime: '2019-05-03T13:06:06+03:00',
    title: 'Что нового в Node.js 10',
    description:
      'Ошибки в Node теперь стандартизованы, для них введены согласованные коды с повторяемыми шаблонами.\n\nОшибки были головной болью при работе в среде Node. Ранее они содержали только строковое сообщение, не связанное с другим идентификатором. Если разработчик хотел, чтобы программа выполняла действия на основе определенного сообщения, единственным вариантом было выполнить строковое сравнение содержимого ошибки.\n\nПоскольку обработка ошибок требовала точного соответствия строк, даже самые маленькие обновления сообщений не могли быть добавлены до следующего основного релиза Node, чтобы это не нарушило SemVer. Отделение ошибок от сообщений упростит работу разработчиками и позволит Node улучшать сообщения об ошибках без внесения изменений.',
  },
  {
    _id: 'cjv7x068j00002y5rx0hnuclh',
    author_name: 'Artem',
    created_at_datetime: '2019-05-03T13:07:48+03:00',
    title: 'Для чего вам отдельно изучать vanilla JavaScript',
    description:
      'Изучение vanilla JavaScript — это все равно что учиться строить дом с нуля. Вы не зависите от комплектов и моделей, которые в долгосрочной перспективе могут не соответствовать требованиям вашей мечты. Хотя это решает краткосрочную проблему необходимости быстрого производства чего-либо, ваша способность создавать собственные конфигурации ограничена тем, что доступно в выбранной вами среде или библиотеке.\n\nИ это еще одна вещь, которую многие разработчики не признают — что существуют фреймворки и библиотеки, помогающие создавать код JavaScript. Без этого вы не сможете создавать то, что вам нужно, на лету. Вы привязываетесь к фреймворкам и библиотекам, которые не будут работать вечно.\n\nКто-нибудь помнит старые добрые времена jQuery? Никто больше не говорит о когда-то популярной библиотеке JavaScript. Всем нужны React и Angular.',
  },
  {
    _id: 'cjv7x27jx00012y5rm3zk9o4x',
    author_name: 'Artem',
    created_at_datetime: '2019-05-03T13:09:23+03:00',
    title: 'Bootstrap — инструмент для верстки сайтов, проверенный временем',
    description:
      'Bootstrap — самый популярный на сегодняшний день HTML, CSS и JavaScript фреймворк для верстки адаптивных, кроссбраузерных, веб-страниц и веб-проектов. Данный инструмент помогает при верстке страниц, упрощает и ускоряет ее.\n\nФреймворк состоит из множества различных компонентов, которые «собирают» веб-страницу: форм, кнопок, навигации, сетки блоков и так далее.\nИзначально Bootstrap был разработан и использовался компанией Twitter для собственных нужд. По мере развития фреймворка, разработчики поняли, что он может быть полезен в большем масштабе, чем просто внутри компании, и представили его широкой общественности.\n\nПервую версию свет увидел в далеком 2011 году. Этот инструмент, который разработчики используют уже много лет, постоянно развивается, и от версии к версии дополняется и улучшается, чтобы идти в ногу со временем. В 2018 году официально вышла четвертая версия, которая актуальна и сейчас.\n\nBootstrap — самый популярный фреймворк. О его популярности говорит отчет от w3Techs, который показывает, что Bootstrap используется на 18,6% всех сайтов, и этот процент постоянно растет.',
  },
  {
    _id: 'cjv7x5oej00002y5r9crck951',
    author_name: 'Artem',
    created_at_datetime: '2019-05-03T13:12:05+03:00',
    title: 'Что нового планируется в JavaScript на 2019 год',
    description:
      'Если коротко, спецификация языка, которая управляет JavaScript, называется ECMAScript. Группа Ecma International, которая рассматривает и принимает изменения в спецификации языка — Технический комитет 39 или TC39. \nПока функция языка не достигнет стадии 4, нет никаких гарантий, что она станет частью официальной спецификации языка ECMAScript. Однако реализации движка JavaScript, такие как V8 (используется Chrome и Node.js) и Firefox SpiderMonkey, могут добавлять экспериментальную поддержку предложенных функций до достижения 4-го уровня, чтобы разработчики могли тестировать и предоставлять обратную связь.',
  },
];

export const users = [
  {
    username: 'Guest',
    password: '',
  },
  {
    username: 'User',
    password: 'user',
  },
  {
    username: 'Admin',
    password: '123',
  },
];
